<template>

  <div class="breadcrumbs">
    <router-link to="/">Внутрироссийская академическая мобильность</router-link>
    <router-link to="/programs">Сетевая программа</router-link>
    <span>Экономика и анализ данных</span>
  </div>

  <div class="content">
    <div class="content__row content__row--center mb-100">
      <div class="content__col content__col--50">
        <div class="text--20-27-500 text--lightgrey mb-10">Магистратура</div>
        <h2 class="mb-10">38.04.01 Экономика и анализ данных</h2>
        <div class="text">РАНХиГС</div>
        <div class="text text--s">Обучение на программе позволяет получить актуальные знания в области экономики и методологии статических измерений, навыки анализа социально-экономических явлений, моделирования и прогнозирования в государственном и муниципальном управлении</div>
        <div class="buttons buttons--left">
          <span class="button button--disabled">Выбрать программу</span>
          <span class="button button--inverse button--inverse-gray">Заполнить заявку</span>
        </div>
      </div>
      <div class="content__col content__col--50">
        <img src="@/assets/style/programs/economy-1.png" alt="" class="img-100">
      </div>
    </div>

    <div class="content__row content__row--center mb-100">
      <div class="content__col content__col--50">
        <h2>О программе</h2>
        <div class="text text--s">
          Программа магистратуры направлена на реализацию образовательных потребностей личности, общества и государства, формирование и развитие креативных способностей и навыков статистического анализа различных сфер экономики с учетом требований работодателей, федеральных и региональных органов государственной власти, органов местного самоуправления, государственных и муниципальных учреждений и организаций общественного сектора. Магистерская программа содействует созданию и развитию единого образовательного пространства и научной среды в области государственной статистики.
        </div>
      </div>
      <div class="content__col content__col--50">
        <div class="icons">
          <div class="icons__item">
            <div class="icons__value icons__value--users">40 человек</div>
            <div class="icons__name">количество мест</div>
          </div>
          <div class="icons__item">
            <div class="icons__value icons__value--form">Заочно</div>
            <div class="icons__name">форма обучения</div>
          </div>
          <div class="icons__item">
            <div class="icons__value icons__value--start">15 сентября</div>
            <div class="icons__name">начало программы</div>
          </div>
          <div class="icons__item">
            <div class="icons__value icons__value--lang">Русский</div>
            <div class="icons__name">язык обучения</div>
          </div>
          <div class="icons__item">
            <div class="icons__value icons__value--days">20 дней</div>
            <div class="icons__name">до конца подачи заявки</div>
          </div>
          <div class="icons__item">
            <div class="icons__value icons__value--document">Диплом</div>
            <div class="icons__name">документ об окончании</div>
          </div>
          <div class="icons__item">
            <div class="icons__value icons__value--time">2,5 года</div>
            <div class="icons__name">продолжительность</div>
          </div>
        </div>
      </div>
    </div>

    <h2>Компетенции и преимущества</h2>
    <div class="content__row content__row--center">
      <div class="content__col content__col--50">
        <img src="@/assets/style/programs/economy-2.png" alt="" class="img-100">
      </div>
      <div class="content__col content__col--50 mb-100">
        <div class="text text--s mb-0">
          <p class="mb-20">Конкурентные преимущества:</p>
          <ul class="ul ul--list">
            <li>актуальный профиль подготовки специалистов для органов государственного и муниципального управления;</li>
            <li>структура программы содержит модули, отвечающие целям комплексного статистического анализа различных секторов экономики;</li>
            <li>применение инновационных методов обучения: деловых и ролевых игр, дискуссий, конференций, в т. ч. с участием специалистов Росстата, что позволяет адаптировать программу к конкретным целям обучающихся;</li>
            <li>применение дистанционных технологий и электронного обучения, в том числе заочная форма реализация программы, расширяют доступ обучающихся из регионов к актуальным статистическим знаниям по вопросам государственного и регионального развития;</li>
            <li>прохождение практики в структурных подразделениях Росстата и других органах власти.</li>
          </ul>
          <p>Область профессиональной деятельности выпускников:Органы государственной власти и местного самоуправления, отвечающие за социально-экономического развитие субъектов Российской Федерации и муниципальных образований.</p>
        </div>
      </div>
    </div>

    <h2>План программы</h2>
    <FaqBlock :faq="faq" />

    <h2>В результате вы узнаете</h2>
    <div class="grid mb-100">
      <div class="text">Формирование умений и навыков проведения отбора и статистического анализа индикаторов социально-экономического развития муниципальных образований, регионов и государства в целом.</div>
      <div class="text">развитие современных форм аналитического мышления, навыков использования основных экономико-математических и статистических моделей и методов, применяемых при исследовании социально-экономических явлений и процессов.</div>
      <div class="text">формирование навыков подготовки аналитических материалов для оценки эффективности мероприятий, реализуемых в рамках политики государственного регулирования социальных и экономических процессов.</div>
    </div>

    <h2>Перечень ключевых дисциплин</h2>
    <table class="table-v2 mb-100">
      <tr>
        <th>Обязательные дисциплины</th>
        <th>Форма контроля</th>
        <th>Академических часов</th>
        <th>Количество ЗЕТ</th>
      </tr>
      <tr>
        <td class="table-v2__td-name">Микроэкономика (продвинутый уровень)</td>
        <td>Зачет</td>
        <td>20</td>
        <td>720</td>
      </tr>
      <tr>
        <td class="table-v2__td-name">Эконометрика (продвинутый уровень)</td>
        <td>Экзамен</td>
        <td>20</td>
        <td>720</td>
      </tr>
      <tr>
        <td class="table-v2__td-name">Компьютерные технологии</td>
        <td>Экзамен</td>
        <td>20</td>
        <td>720</td>
      </tr>
      <tr>
        <td class="table-v2__td-name">Философия и методология науки</td>
        <td>Экзамен</td>
        <td>20</td>
        <td>720</td>
      </tr>
      <tr>
        <td class="table-v2__td-name">Инструментальные методы экономического анализа</td>
        <td>Зачет с оценкой</td>
        <td>20</td>
        <td>720</td>
      </tr>
    </table>

    <h2>Учебный план</h2>
    <CurriculumTabs :curriculum="curriculum" />

    <h2>Где можно пройти обучение</h2>
    <div class="map mb-100">
      <iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d119892.45920816272!2d37.62803071400508!3d55.72242199410446!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x414ab522f420ec37%3A0xf59f393fec7aaa2!2z0KDQkNCd0KXQuNCT0KE!5e0!3m2!1sru!2str!4v1669560869007!5m2!1sru!2str" width="600" height="450" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>
    </div>

    <h2>Основная информация</h2>
    <div class="dl mb-100">
      <div class="dl__item">
        <div class="dl__dt">Профиль:</div>
        <div class="dl__dd">Любой</div>
      </div>
      <div class="dl__item">
        <div class="dl__dt">Возраст:</div>
        <div class="dl__dd">Любой</div>
      </div>
      <div class="dl__item">
        <div class="dl__dt">Стоимость:</div>
        <div class="dl__dd">Бесплатно</div>
      </div>
      <div class="dl__item">
        <div class="dl__dt">Сфера деятельности:</div>
        <div class="dl__dd">Экономика</div>
      </div>
      <div class="dl__item">
        <div class="dl__dt">Форма обучения:</div>
        <div class="dl__dd">Заочная</div>
      </div>
      <div class="dl__item">
        <div class="dl__dt">Документ после обучения:</div>
        <div class="dl__dd">Диплом</div>
      </div>
    </div>

    <h2>Похожие программы</h2>
    <div class="tiles">
      <ProgramsList limit="3" />
    </div>
  </div>
</template>

<script>
import CurriculumTabs from '@/components/CurriculumTabs.vue'
import FaqBlock from '@/components/FaqBlock.vue'
import ProgramsList from "@/components/ProgramsList";

export default {
  name: 'EconomyView',
  components: {
    CurriculumTabs,
    FaqBlock,
    ProgramsList
  },
  data() {
    return {
      faq: [
        {
          show: true,
          q: 'Узнаете о навыках и инструментах.',
          a: 'Самая объемная и насыщенная программа, которая раскрывает способы формирования умений и навыков применять современные статистические методы и технологии в области управления социально-экономическим развитием для выработки компетентных управленческих решений',
        }, {
          show: false,
          q: 'По каким программам будет проходить обучение?',
          a: 'Самая объемная и насыщенная программа, которая раскрывает способы формирования умений и навыков применять современные статистические методы и технологии в области управления социально-экономическим развитием для выработки компетентных управленческих решений',
        }, {
          show: false,
          q: 'Научитесь применять современные статистические методы и технологии в области управления социально-экономическим развитием.',
          a: 'Самая объемная и насыщенная программа, которая раскрывает способы формирования умений и навыков применять современные статистические методы и технологии в области управления социально-экономическим развитием для выработки компетентных управленческих решений',
        }, {
          show: false,
          q: 'Формирование умений составлять статистические прогнозы и применять методы стратегического видения при формировании программ развития секторов экономики',
          a: 'Самая объемная и насыщенная программа, которая раскрывает способы формирования умений и навыков применять современные статистические методы и технологии в области управления социально-экономическим развитием для выработки компетентных управленческих решений',
        },
      ],
      curriculum: {
        tabs: [
          {
            name: 'Изучаемые предметы',
            tabs: [
              {
                name: 'Обязательные дисциплины',
                items: [
                  {
                    time: '38 часов',
                    subTitle: '1 курс',
                    title: 'Русский язык и культура речи'
                  }, {
                    time: '36 часов',
                    subTitle: '3 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  }, {
                    time: '38 часов',
                    subTitle: '1 курс',
                    title: 'Русский язык и культура речи'
                  }, {
                    time: '36 часов',
                    subTitle: '3 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  }, {
                    time: '36 часов',
                    subTitle: '3 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  },
                ]
              }, {
                name: 'Дополнительные дисциплины',
                items: [
                  {
                    time: '38 часов',
                    subTitle: '1 курс',
                    title: 'Русский язык и культура речи'
                  }, {
                    time: '36 часов',
                    subTitle: '3 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  }, {
                    time: '38 часов',
                    subTitle: '1 курс',
                    title: 'Русский язык и культура речи'
                  }, {
                    time: '36 часов',
                    subTitle: '3 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  }, {
                    time: '36 часов',
                    subTitle: '3 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  }, {
                    time: '36 часов',
                    subTitle: '3 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  }, {
                    time: '36 часов',
                    subTitle: '3 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  },
                ]
              }
            ]
          },
          {
            name: 'Учебный план',
            tabs: [
              {
                name: '1 курс',
                items: [
                  {
                    time: '38 часов',
                    subTitle: '1 курс',
                    title: 'Русский язык и культура речи'
                  }, {
                    time: '36 часов',
                    subTitle: '1 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  }, {
                    time: '38 часов',
                    subTitle: '1 курс',
                    title: 'Русский язык и культура речи'
                  }, {
                    time: '36 часов',
                    subTitle: '1 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  }, {
                    time: '36 часов',
                    subTitle: '1 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  },
                ]
              }, {
                name: '2 курс',
                items: [
                  {
                    time: '38 часов',
                    subTitle: '2 курс',
                    title: 'Русский язык и культура речи'
                  }, {
                    time: '36 часов',
                    subTitle: '2 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  }, {
                    time: '38 часов',
                    subTitle: '2 курс',
                    title: 'Русский язык и культура речи'
                  }, {
                    time: '36 часов',
                    subTitle: '2 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  }, {
                    time: '36 часов',
                    subTitle: '2 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  }, {
                    time: '36 часов',
                    subTitle: '2 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  }, {
                    time: '36 часов',
                    subTitle: '2 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  },
                ]
              }, {
                name: '3 курс',
                items: [
                  {
                    time: '38 часов',
                    subTitle: '3 курс',
                    title: 'Русский язык и культура речи'
                  }, {
                    time: '36 часов',
                    subTitle: '3 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  }, {
                    time: '38 часов',
                    subTitle: '3 курс',
                    title: 'Русский язык и культура речи'
                  }, {
                    time: '36 часов',
                    subTitle: '3 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  }, {
                    time: '36 часов',
                    subTitle: '3 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  },{
                    time: '36 часов',
                    subTitle: '3 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  },
                ]
              }, {
                name: '4 курс',
                items: [
                  {
                    time: '38 часов',
                    subTitle: '4 курс',
                    title: 'Русский язык и культура речи'
                  }, {
                    time: '36 часов',
                    subTitle: '4 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  }, {
                    time: '38 часов',
                    subTitle: '4 курс',
                    title: 'Русский язык и культура речи'
                  }, {
                    time: '36 часов',
                    subTitle: '4 курса',
                    title: 'Элективные дисциплины по физической культуре и спорту',
                  },
                ]
              }
            ]
          }
        ]
      }
    }
  }
}
</script>
